soap_client/TestSoapServiceBind.SampleTest.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns1="http://localhost/TestSoapService/v1"
    xmlns:ns2="http://localhost/TestSoapService/schema">
 <SOAP-ENV:Body>
  <ns2:SampleTestRes>
   <ns2:Id></ns2:Id>
   <ns2:InfoData></ns2:InfoData>
   <ns2:Description>0</ns2:Description>
   <ns2:resultCode>0</ns2:resultCode>
  </ns2:SampleTestRes>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
