soap_server/TestSoapServiceBind.SampleTest.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns1="http://localhost/TestSoapService/v1"
    xmlns:ns2="http://localhost/TestSoapService/schema">
 <SOAP-ENV:Body>
   <ns2:SampleTestReq>
    <ns2:Id>0</ns2:Id>
    <ns2:InfoName></ns2:InfoName>
   </ns2:SampleTestReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
